# Лабораторная работа №1
## Калькулятор в обратной польской нотации

Консольный калькулятор для вычисления выражений в обратной польской нотации (RPN).
Уровень М3

**Парсер**

- Автоматически добавляет внешние скобки при их отсутствии
- Поддерживает вложенные выражения и последовательные вычисления
- Рекурсивная обработка сложных конструкций


### Возможности

- Базовые операции: `+`, `-`, `*`, `/`, `//`, `%`, `**`
- Унарные операторы: `$` (плюс), `~` (минус)
- Функции: `abs`, `sqrt`, `pow`, `max`, `min`


**Основные допущения**
- Выражения могут быть с внешними скобками или без них
- Функции `max`/`min` принимают все доступные аргументы из стека
- `//` и `%` работают только с целыми числами
- Деление на ноль вызывает ошибку
- Калькулятор работает и с базовыми выражениями польской нотации без скобок, такими как: **5 6 +**



### Примеры вычисления одиночных выражений

```bash
# Вычисление одного выражения
python -m src.main --expr "(3 4 2 * +)"
# => 11

python -m src.main --expr "(2 3 pow)"
# => 8

python -m src.main --expr "(1 5 3 max)"
# => 5

python -m src.main --expr "(5 ~)"
# => -5

python -m src.main --expr "(8 (3 2 +) -) 4 *"
# => 12
```

### Интерактивный режим
```bash
python -m src.main
```
### Примеры
```bash
RPN REPL. Введите выражение в обратной польской нотации. 'exit' для выхода.
RPN> (3 4 +)
= 7
RPN> (5 ~)
= -5
RPN> (2 3 pow)
= 8
RPN> (1 5 3 max)
= 5
RPN> (8 (3 2 +) -) 4 *
= 12
RPN> exit
```

### Тестирование
```bash
pytest -v
```

### Итоги работы
- Реализован калькулятор уровня М3 с двумя режимами работы (одиночные выражения - через expr; и интерактивный - REPL), который поддерживает RPN выражения.
